## Plan Result (883: stg_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 15 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
* Delete
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;01-ingest01-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["00-ingest00-logic-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-logic-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-logic-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["00-ingest00-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-logic-stg/providers/Microsoft.Authorization/roleAssignments/51302a77-101c-4d0c-5443-baa15dc4c14f" -> null
      - name                                   = "51302a77-101c-4d0c-5443-baa15dc4c14f" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-logic-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["00-ingest00-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Authorization/roleAssignments/49121766-120e-b485-4fb2-8c9353e13dbc" -> null
      - name                                   = "49121766-120e-b485-4fb2-8c9353e13dbc" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["00-ingest00-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Authorization/roleAssignments/34dcaa36-9c6e-27e4-d452-997955c48684" -> null
      - name                                   = "34dcaa36-9c6e-27e4-d452-997955c48684" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-logic-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-logic-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["01-ingest01-logic-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-logic-stg/providers/Microsoft.Authorization/roleAssignments/bffe2f3e-e1dc-af2e-a6af-d0dcba990cd0" -> null
      - name                                   = "bffe2f3e-e1dc-af2e-a6af-d0dcba990cd0" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-logic-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["01-ingest01-main-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Authorization/roleAssignments/8d5685cf-c27b-dfcf-3050-e8f4a3b453a4" -> null
      - name                                   = "8d5685cf-c27b-dfcf-3050-e8f4a3b453a4" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-stg-Group-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-network-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-stg-Group-Storage-Blob-Data-Reader-DTS DLRM Data Ingestion Admin Eligible (env:staging)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f633c638-2f38-4d2d-85c9-bd1bea97e371"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-network-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["01-ingest01-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be destroyed
  # (because key ["01-ingest01-network-stg-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-network-stg/providers/Microsoft.Authorization/roleAssignments/3e4fdc31-8208-6275-2560-9e479619ed80" -> null
      - name                                   = "3e4fdc31-8208-6275-2560-9e479619ed80" -> null
      - principal_id                           = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-network-stg" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logic-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-stg-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-network-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00curatedstg"
        name                               = "ingest00curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "109.153.120.106",
              - "82.33.21.159",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00externalstg"
        name                               = "ingest00externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"
        name                               = "ingest00landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "82.33.21.159",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00rawstg"
        name                               = "ingest00rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00workspacestg"
        name                               = "ingest00workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01curatedstg"
        name                               = "ingest01curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01externalstg"
        name                               = "ingest01externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01landingstg"
        name                               = "ingest01landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01rawstg"
        name                               = "ingest01rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01workspacestg"
        name                               = "ingest01workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "ARIA"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05curatedstg"
        name                               = "ingest05curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05externalstg"
        name                               = "ingest05externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05landingstg"
        name                               = "ingest05landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05rawstg"
        name                               = "ingest05rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05workspacestg"
        name                               = "ingest05workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 15 to add, 15 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":137,"Program":"tfcmt","SHA1":"","Target":"883: stg_landing - TerraformPlanApply","Vars":{}} -->